const strstr=require("./strstr");
const page=`我聞如是：　一時，佛遊舍衛國，在勝林給孤
獨園。　爾時，世尊告諸比丘：「若有比丘成就
七法者，便於賢聖得歡喜樂，正趣漏盡。云
何為七？謂比丘知法、知義、知時、知節、知
己、知眾、知人勝如。　「云何比丘為知法耶？謂
比丘知正經、歌詠、記說、偈咃、因緣、撰錄、
本起、此說、生處、廣解、未曾有法及說是義，
是謂比丘為知法也。若有比丘不知法者，
謂不知正經、歌詠、記說、偈咃、因緣、撰錄、本
起、此說、生處、廣解、未曾有法及說義，如是比
丘為不知法。若有比丘善知法者，謂知正
經、歌詠、記說、偈咃、因緣、撰錄、本起、此說、生處、廣
解、未曾有法及說義，是謂比丘善知法也。　「云
何比丘為知義耶？謂比丘知彼彼說義是彼
義、是此義，是謂比丘為知義也。若有比丘
不知義者，謂不知彼彼說義是彼義、是此
義，如是比丘為不知義。若有比丘善知
義者，謂知彼彼說義是彼義、是此義，是謂
比丘善知義也。　「云何比丘為知時耶？謂比
丘知是時修下相，是時修高相，是時修捨
相，是謂比丘為知時也。若有比丘不知
時者，謂不知是時修下相，是時修高相，是
時修捨相，如是比丘為不知時。若有比
丘善知時者，謂知是時修下相，是時修高
相，是時修捨相，是謂比丘善知時也。　「云何
比丘為知節耶？謂比丘知節，若飲若食、若
去若住、若坐若臥、若語若默、若大小便，捐
除睡眠，修行正智，是謂比丘為知節也。若
有比丘不知節者，謂不知若飲若食、若去
若住、若坐若臥、若語若默、若大小便，捐除睡
眠，修行正智，如是比丘為不知節。若有
比丘善知節者，謂知若飲若食，若去若住，若
坐若臥、若語若默、若大小便，捐除睡眠，
修行正智，是謂比丘善知節也。　「云何比丘
為知己耶？謂比丘自知我有爾所信、戒、聞、
施、慧、辯、阿含及所得，是謂比丘為知己也。
若有比丘不知己者，謂不自知我有爾
所信、戒、聞、施、慧、辯、阿含及所得，如是比丘為
不知己。若有比丘善知己者，謂自知我
有爾所信、戒、聞、施、慧、辯、阿含及所得，是謂比
丘善知己也。　「云何比丘為知眾耶？謂比丘
知此剎利眾、此梵志眾、此居士眾、此沙門
眾，我於彼眾應如是去、如是住、如是坐、
如是語、如是默，是謂比丘為知眾也。若有
比丘不知眾者，謂不知此剎利眾、此梵志
眾、此居士眾、此沙門眾，我於彼眾應如是
去、如是住、如是坐、如是語、如是默，如是比
丘為不知眾。若有比丘善知眾者，謂知
此剎利眾、此梵志眾、此居士眾、此沙門眾、我
於彼眾應如是去、如是住、如是坐、如是語、
如是默，是謂比丘善知眾也。　「云何比丘知
人勝如？謂比丘知有二種人，有信、有不信；
若信者勝，不信者為不如也。謂信人復有
二種，有數往見比丘、有不數往見比丘；若
數往見比丘者勝，不數往見比丘者為不
如也。謂數往見比丘人復有二種，有禮敬
比丘、有不禮敬比丘；若禮敬比丘者勝，不
禮敬比丘者為不如也。謂禮敬比丘人復
有二種，有問經、有不問經；若問經者勝，
不問經者為不如也。謂問經人復有二種，
有一心聽經、有不一心聽經；若一心聽
經者勝，不一心聽經者為不如也。謂一
心聽經人復有二種，有聞持法、有聞不
持法；若聞持法者勝，聞不持法者為不
如也。謂聞持法人復有二種，有聞法觀
義、有聞法不觀義；若聞法觀義者勝，聞
法不觀義者為不如也。謂聞法觀義人
復有二種，有知法、知義、向法次法、隨順
於法、如法行之；有不知法、不知義、不向
法次法、不隨順法、不如法行。若知法、知
義、向法次法、隨順於法、如法行者勝；不知
法、不知義、不向法次法、不隨順法、不
如法行者為不如也。謂知法、知義、向法
次法、隨順於法、如法行人復有二種，有
自饒益，亦饒益他，饒益多人，愍傷世間，為
天、為人求義及饒益，求安隱快樂；有不自
饒益，亦不饒益他，不饒益多人，不愍傷
世間，不為天、不為人求義及饒益，求安
隱快樂。若自饒益，亦饒益他，饒益多人，愍
傷世間，為天、為人求義及饒益，求安隱
快樂者，此人於彼人中為極第一，為大、為
上、為最、為勝、為尊、為妙。譬如因牛有乳，
因乳有酪，因酪有生酥，因生酥有熟酥，
因熟酥有酥精，酥精者，於彼中為極第一，
為大、為上、為最、為勝、為尊、為妙，如是若
人自饒益，亦饒益他，饒益多人，愍傷世間，
為天、為人求義及饒益，求安隱快樂。此二
人如上所說，如上分別，如上施設，此為第
一，為大，為上、為最、為勝、為尊、為妙，是謂
比丘知人勝如。」　佛說如是。彼諸比丘聞佛
所說，歡喜奉行。`
const q="因緣、本起、撰錄、";

const matches=strstr.indexOf(page,q);

matches.map(function(m){
	console.log(page.substring(m[0],m[1]));
})